In [1]:
import ibm_db
import ibm_db_dbi
import pandas as pd

In [2]:
conn = ibm_db.connect(
    "DATABASE=sample;HOSTNAME=localhost;PORT=50000;PROTOCOL=TCPIP;UID=db2inst1;PWD=db2inst1;",
    "", "")
c = ibm_db_dbi.Connection(conn)

In [3]:
def get_data_from_db2(sql):
    stmt = ibm_db.exec_immediate(conn, sql)
    #result = ibm_db.fetch_both(stmt)
    result = ibm_db.fetch_assoc(stmt)
    while result:
        print(result)
        result = ibm_db.fetch_assoc(stmt)

In [4]:
df = pd.read_sql("SELECT * FROM STAFF", c)

In [5]:
df

     ID       NAME  DEPT    JOB  YEARS    SALARY     COMM
0    10    Sanders    20  Mgr      7.0  98357.50      NaN
1    20     Pernal    20  Sales    8.0  78171.25   612.45
2    30   Marenghi    38  Mgr      5.0  77506.75      NaN
3    40    O'Brien    38  Sales    6.0  78006.00   846.55
4    50      Hanes    15  Mgr     10.0  80659.80      NaN
5    60    Quigley    38  Sales    NaN  66808.30   650.25
6    70    Rothman    15  Sales    7.0  76502.83  1152.00
7    80      James    20  Clerk    NaN  43504.60   128.20
8    90    Koonitz    42  Sales    6.0  38001.75  1386.70
9   100      Plotz    42  Mgr      7.0  78352.80      NaN
10  110       Ngan    15  Clerk    5.0  42508.20   206.60
11  120   Naughton    38  Clerk    NaN  42954.75   180.00
12  130  Yamaguchi    42  Clerk    6.0  40505.90    75.60
13  140      Fraye    51  Mgr      6.0  91150.00      NaN
14  150   Williams    51  Sales    6.0  79456.50   637.65
15  160   Molinare    10  Mgr      7.0  82959.20      NaN
16  170   Kermisch    15  Clerk    4.0  42258.50   110.10
17  180   Abrahams    38  Clerk    3.0  37009.75   236.50
18  190    Sneider    20  Clerk    8.0  34252.75   126.50
19  200   Scoutten    42  Clerk    NaN  41508.60    84.20
20  210         Lu    10  Mgr     10.0  90010.00      NaN
21  220      Smith    51  Sales    7.0  87654.50   992.80
22  230  Lundquist    51  Clerk    3.0  83369.80   189.65
23  240    Daniels    10  Mgr      5.0  79260.25      NaN
24  250    Wheeler    51  Clerk    6.0  74460.00   513.30
25  260      Jones    10  Mgr     12.0  81234.00      NaN
26  270        Lea    66  Mgr      9.0  88555.50      NaN
27  280     Wilson    66  Sales    9.0  78674.50   811.50
28  290      Quill    84  Mgr     10.0  89818.00      NaN
29  300      Davis    84  Sales    5.0  65454.50   806.10
30  310     Graham    66  Sales   13.0  71000.00   200.30
31  320   Gonzales    66  Sales    4.0  76858.20   844.00
32  330      Burke    66  Clerk    1.0  49988.00    55.50
33  340    Edwards    84  Sales    7.0  67844.00  1285.00
34  350     Gafney    84  Clerk    5.0  43030.50   188.00

In [6]:
# show tables
df2 = pd.read_sql("select * from syscat.tables where TABSCHEMA='DB2INST1' and type='T'", c)

In [7]:
df2

,TABSCHEMA,TABNAME,OWNER,OWNERTYPE,TYPE,STATUS,BASE_TABSCHEMA,BASE_TABNAME,ROWTYPESCHEMA,ROWTYPENAME,...,ONCOMMIT,LOGGED,ONROLLBACK,LASTUSED,CONTROL,TEMPORALTYPE,TABLEORG,EXTENDED_ROW_SIZE,PCTEXTENDEDROWS,REMARKS
0,DB2INST1,CL_SCHED,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
1,DB2INST1,DEPARTMENT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
2,DB2INST1,EMPPROJACT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
3,DB2INST1,EMPLOYEE,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
4,DB2INST1,EMP_PHOTO,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
5,DB2INST1,EMP_RESUME,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
6,DB2INST1,PROJECT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
7,DB2INST1,PROJACT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
8,DB2INST1,ACT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
9,DB2INST1,IN_TRAY,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
10,DB2INST1,ORG,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
11,DB2INST1,STAFF,DB2INST1,U,T,N,None,None,None,None,...,,,,2018-08-02,,N,R,N,-1.0,None
12,DB2INST1,SALES,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
13,DB2INST1,STAFFG,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
14,DB2INST1,EMPMDC,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
15,DB2INST1,PRODUCT,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
16,DB2INST1,INVENTORY,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
17,DB2INST1,CUSTOMER,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
18,DB2INST1,PURCHASEORDER,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
19,DB2INST1,CATALOG,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
20,DB2INST1,SUPPLIERS,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None
21,DB2INST1,PRODUCTSUPPLIER,DB2INST1,U,T,N,None,None,None,None,...,,,,0001-01-01,,N,R,N,-1.0,None

In [8]:
# desc table_name
df3 = pd.read_sql("SELECT NAME, COLTYPE, LENGTH, SCALE FROM SYSIBM.SYSCOLUMNS WHERE TBNAME = 'STAFF'", c)

In [9]:
df3

     NAME   COLTYPE  LENGTH  SCALE
0    COMM  DECIMAL        7      2
1    DEPT  SMALLINT       2      0
2      ID  SMALLINT       2      0
3     JOB  CHAR           5      0
4    NAME  VARCHAR        9      0
5  SALARY  DECIMAL        7      2
6   YEARS  SMALLINT       2      0